# 7.写出一个程序，接受一个正浮点数值，输出该数值的近似整数值。如果小数点后数值大于等于5,向上取整；小于5，则向下取整
print(round(float(input())+0.001))
############################################################################################################
# 8. 数据表记录包含表索引和数值，请对表索引相同的记录进行合并，即将相同索引的数值进行求和运算，输出按照key值升序进行输出
from collections import defaultdict
while True:
    try:
        a=int(input())
        dd=defaultdict(int) #指定字典的值为int
        for i in range(a):
            key,val=map(int,input().split())
            dd[key]+=val
        for i in sorted(dd.keys()):
            print(str(i)+" "+str(dd[i]))
    except:
        break
############################################################################################################
# 9.输入一个int型整数，按照从右向左的阅读顺序，返回一个不含重复数字的新的整数。
ss = input()[::-1]
res = []
for i in ss:
    if i not in res:
        res.append(i)
print(''.join(res))
############################################################################################################
# 10.编写一个函数，计算字符串中含有的不同字符的个数。字符在ACSII码范围内(0~127)。不在范围内的不作统计。
print (len(set([i for i in input() if ord(i) in range(128)])))

import sys
print(len(set(list(sys.stdin.readline()))))
############################################################################################################
# 11.输入一个整数，将这个整数以字符串的形式逆序输出,程序不考虑负数的情况，若数字含有0，则逆序形式也含有0，如输入为100，则输出为001
print(input()[::-1])
# 13.将一个英文语句以单词为单位逆序排放。例如“I am a boy”，逆序排放后为“boy a am I”所有单词之间用一个空格隔开，语句中除了英文字母外，不再包含其他字符
print(" ".join(input().split()[::-1]))
############################################################################################################
# 14.给定n个字符串，请对n个字符串按照字典序排列。
num = int(input())
s = []
for i in range(num):
    s.append(input())
s.sort()
for i in s:
    print (i)
############################################################################################################
# 15.输入一个int型的正整数，计算出该int型数据在内存中存储时1的个数。
a=int(input())
print(bin(a).replace("0b","").count("1"))
